<?php

use Illuminate\Database\Seeder;

class IsicTablesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('isics')->insert([
            [
                'name' => 'เกษตรกรรม การป่าไม้ และการประมง',
                'code' => 'A000000',
            ],
            [
                'name' => 'การทำเหมืองแร่และเหมืองหิน',
                'code' => 'B000000',
            ],
            [
                'name' => 'การผลิต',
                'code' => 'C000000',
            ],
            [
                'name' => 'ไฟฟ้า ก๊าซ ไอน้ำ และระบบปรับอากาศ',
                'code' => 'D000000',
            ],
            [
                'name' => 'การจัดหาน้ำ การจัดการ และการบำบัดน้ำเสีย ของเสีย และสิ่งปฏิกูล',
                'code' => 'E000000',
            ],
            [
                'name' => 'การก่อสร้าง',
                'code' => 'F000000',
            ],
            [
                'name' => 'การขายส่งและการขายปลีก การซ่อมยานยนต์และจักรยานยนต์',
                'code' => 'G000000',
            ],
            [
                'name' => 'การขนส่งและสถานที่เก็บสินค้า',
                'code' => 'H000000',
            ],
            [
                'name' => 'ที่พักแรมและบริการด้านอาหาร',
                'code' => 'I000000',
            ],
            [
                'name' => 'ข้อมูลข่าวสารและการสื่อสาร',
                'code' => 'J000000',
            ],
            [
                'name' => 'กิจกรรมทางการเงินและการประกันภัย',
                'code' => 'K000000',
            ],
            [
                'name' => 'กิจกรรมอสังหาริมทรัพย์',
                'code' => 'L000000',
            ],
            [
                'name' => 'กิจกรรมทางวิชาชีพ วิทยาศาสตร์ และเทคนิค',
                'code' => 'M000000',
            ],
            [
                'name' => 'กิจกรรมการบริหารและการบริการสนับสนุน',
                'code' => 'N000000',
            ],
            [
                'name' => 'การบริหารราชการ การป้องกันประเทศ และการประกันสังคมภาคบังคับ',
                'code' => 'O000000',
            ],
            [
                'name' => 'การศึกษา',
                'code' => 'P000000',
            ],
            [
                'name' => 'กิจกรรมด้านสุขภาพและงานสังคมสงเคราะห์',
                'code' => 'Q000000',
            ],
            [
                'name' => 'ศิลปะ ความบันเทิง และนันทนาการ',
                'code' => 'R000000',
            ],
            [
                'name' => 'กิจกรรมบริการด้านอื่นๆ',
                'code' => 'S000000',
            ],
            [
                'name' => 'กิจกรรมการจ้างงานในครัวเรือนส่วนบุคคล กิจกรรมการผลิตสินค้าและบริการที่ทำขึ้นเองเพื่อใช้ในครัวเรือน ซึ่งไม่สามารถจำแนกกิจกรรมได้อย่างชัดเจน',
                'code' => 'T000000',
            ],
            [
                'name' => 'กิจกรรมขององค์การระหว่างประเทศและภาคีสมาชิก',
                'code' => 'U000000',
            ]
        ]);
    }
}
