<?php

use Illuminate\Database\Seeder;

class IsicSubsTablesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('isic_subs')->insert([
            [
                'isic_id' => 1,
                'name' => 'การเพาะปลูกและการเลี้ยงสัตว์ การล่าสัตว์ และกิจกรรมบริการที่เกี่ยวข้อง',
                'code' => 'A010000',
            ],
            [
                'isic_id' => 1,
                'name' => 'การป่าไม้และการทำไม้',
                'code' => 'A020000',
            ],
            [
                'isic_id' => 1,
                'name' => 'การประมงและการเพาะเลี้ยงสัตว์น้ำ',
                'code' => 'A030000',
            ],
            [
                'isic_id' => 2,
                'name' => 'การทำเหมืองถ่านหินและลิกไนต์',
                'code' => 'B050000',
            ],
            [
                'isic_id' => 2,
                'name' => 'การขุดเจาะปิโตรเลียมดิบและก๊าซธรรมชาติ',
                'code' => 'B060000',
            ],
            [
                'isic_id' => 2,
                'name' => 'การทำเหมืองสินแร่โลหะ',
                'code' => 'B070000',
            ],
            [
                'isic_id' => 2,
                'name' => 'การทำเหมืองแร่และเหมืองหินอื่นๆ',
                'code' => 'B080000',
            ],
            [
                'isic_id' => 2,
                'name' => 'กิจกรรมบริการที่สนับสนุนการทำเหมืองแร่',
                'code' => 'B090000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตผลิตภัณฑ์อาหาร',
                'code' => 'C100000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตเครื่องดื่ม',
                'code' => 'C110000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตผลิตภัณฑ์ยาสูบ',
                'code' => 'C120000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตสิ่งทอ',
                'code' => 'C130000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตเสื้อผ้าเครื่องแต่งกาย',
                'code' => 'C140000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตเครื่องหนังและผลิตภัณฑ์ที่เกี่ยวข้อง',
                'code' => 'C150000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตไม้และผลิตภัณฑ์จากไม้และไม้ก๊อก (ยกเว้นเฟอร์นิเจอร์) การผลิตสิ่งของจากฟางและวัสดุถักสานอื่นๆ',
                'code' => 'C160000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตกระดาษและผลิตภัณฑ์กระดาษ',
                'code' => 'C170000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การพิมพ์และการผลิตซ้ำสื่อบันทึกข้อมูล',
                'code' => 'C180000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตถ่านโค้กและผลิตภัณฑ์จากการกลั่นปิโตรเลียม',
                'code' => 'C190000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตเคมีภัณฑ์และผลิตภัณฑ์เคมี',
                'code' => 'C200000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตเภสัชภัณฑ์ เคมีภัณฑ์ที่ใช้รักษาโรค และผลิตภัณฑ์จากพืชและสัตว์ที่ใช้รักษาโรค',
                'code' => 'C210000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตผลิตภัณฑ์ยางและพลาสติก',
                'code' => 'C220000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตผลิตภัณฑ์อื่นๆ ที่ทำจากแร่อโลหะ',
                'code' => 'C230000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตโลหะขั้นมูลฐาน',
                'code' => 'C240000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตผลิตภัณฑ์ที่ทำจากโลหะประดิษฐ์ (ยกเว้นเครื่องจักรและอุปกรณ์)',
                'code' => 'C250000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตผลิตภัณฑ์คอมพิวเตอร์ อิเล็กทรอนิกส์ และอุปกรณ์ที่ใช้ในทางทัศนศาสตร์',
                'code' => 'C260000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตอุปกรณ์ไฟฟ้า',
                'code' => 'C270000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตเครื่องจักรและเครื่องมือ ซึ่งมิได้จัดประเภทไว้ในที่อื่น',
                'code' => 'C280000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตยานยนต์ รถพ่วง และรถกึ่งพ่วง',
                'code' => 'C290000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตอุปกรณ์ขนส่งอื่นๆ',
                'code' => 'C300000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตเฟอร์นิเจอร์',
                'code' => 'C310000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การผลิตผลิตภัณฑ์ประเภทอื่นๆ',
                'code' => 'C320000',
            ],
            [
                'isic_id' => 3,
                'name' => 'การซ่อมและการติดตั้งเครื่องจักรและอุปกรณ์',
                'code' => 'C330000',
            ],
            [
                'isic_id' => 4,
                'name' => 'ไฟฟ้า ก๊าซ ไอน้ำ และระบบปรับอากาศ',
                'code' => 'D350000',
            ],
            [
                'isic_id' => 5,
                'name' => 'การเก็บกักน้ำ การจัดหาน้ำ และการจ่ายน้ำ',
                'code' => 'E360000',
            ],
            [
                'isic_id' => 5,
                'name' => 'การจัดการน้ำเสีย',
                'code' => 'E370000',
            ],
            [
                'isic_id' => 5,
                'name' => 'การเก็บรวบรวมของเสีย การบำบัด และการกำจัดของเสีย รวมถึงการนำของเสียกลับมาใช้ใหม่',
                'code' => 'E380000',
            ],
            [
                'isic_id' => 5,
                'name' => 'กิจกรรมการบำบัดและบริการจัดการของเสียอื่นๆ',
                'code' => 'E390000',
            ],
            [
                'isic_id' => 6,
                'name' => 'การก่อสร้างอาคาร',
                'code' => 'F410000',
            ],
            [
                'isic_id' => 6,
                'name' => 'งานวิศวกรรมโยธา',
                'code' => 'F420000',
            ],
            [
                'isic_id' => 6,
                'name' => 'งานก่อสร้างเฉพาะงาน',
                'code' => 'F430000',
            ],
            [
                'isic_id' => 7,
                'name' => 'การขายส่งและการขายปลีก การซ่อมยานยนต์และจักรยานยนต์',
                'code' => 'G450000',
            ],
            [
                'isic_id' => 7,
                'name' => 'การขายส่ง (ยกเว้นยานยนต์และจักรยานยนต์)',
                'code' => 'G460000',
            ],
            [
                'isic_id' => 7,
                'name' => 'การขายปลีก (ยกเว้นยานยนต์และจักรยานยนต์)',
                'code' => 'G470000',
            ],
            [
                'isic_id' => 8,
                'name' => 'การขนส่งทางบกและการขนส่งทางท่อลำเลียง',
                'code' => 'H490000',
            ],
            [
                'isic_id' => 8,
                'name' => 'การขนส่งทางน้ำ',
                'code' => 'H500000',
            ],
            [
                'isic_id' => 8,
                'name' => 'การขนส่งทางอากาศ',
                'code' => 'H510000',
            ],
            [
                'isic_id' => 8,
                'name' => 'กิจกรรมคลังสินค้าและกิจกรรมที่สนับสนุนการขนส่ง',
                'code' => 'H520000',
            ],
            [
                'isic_id' => 8,
                'name' => 'กิจกรรมไปรษณีย์และการรับส่งพัสดุภัณฑ์',
                'code' => 'H530000',
            ],
            [
                'isic_id' => 9,
                'name' => 'ที่พักแรม',
                'code' => 'I550000',
            ],
            [
                'isic_id' => 9,
                'name' => 'การบริการอาหารและเครื่องดื่ม',
                'code' => 'I560000',
            ],
            [
                'isic_id' => 10,
                'name' => 'การจัดพิมพ์จำหน่ายหรือเผยแพร่',
                'code' => 'J580000',
            ],
            [
                'isic_id' => 10,
                'name' => 'การผลิตภาพยนตร์ วีดิทัศน์ และรายการโทรทัศน์ การบันทึกเสียงลงบนสื่อ และการจัดพิมพ์จำหน่ายหรือเผยแพร่ดนตรี',
                'code' => 'J590000',
            ],
            [
                'isic_id' => 10,
                'name' => 'การจัดผังรายการและการแพร่ภาพกระจายเสียง',
                'code' => 'J600000',
            ],
            [
                'isic_id' => 10,
                'name' => 'การโทรคมนาคม',
                'code' => 'J610000',
            ],
            [
                'isic_id' => 10,
                'name' => 'การจัดทำโปรแกรมคอมพิวเตอร์ การให้คำปรึกษาเกี่ยวกับคอมพิวเตอร์ และกิจกรรมที่เกี่ยวข้อง',
                'code' => 'J620000',
            ],
            [
                'isic_id' => 10,
                'name' => 'การบริการสารสนเทศ',
                'code' => 'J630000',
            ],
            [
                'isic_id' => 11,
                'name' => 'กิจกรรมบริการทางการเงิน (ยกเว้นการประกันภัยและกองทุนบำเหน็จบำนาญ)',
                'code' => 'K640000',
            ],
            [
                'isic_id' => 11,
                'name' => 'การประกันภัย การประกันภัยต่อ และกองทุนบำเหน็จบำนาญ (ยกเว้นการประกันสังคมภาคบังคับ)',
                'code' => 'K650000',
            ],
            [
                'isic_id' => 11,
                'name' => 'กิจกรรมสนับสนุนการบริการทางการเงินและการประกันภัย',
                'code' => 'K660000',
            ],
            [
                'isic_id' => 12,
                'name' => 'กิจกรรมอสังหาริมทรัพย์',
                'code' => 'L680000',
            ],
            [
                'isic_id' => 13,
                'name' => 'กิจกรรมทางกฎหมายและการบัญชี',
                'code' => 'M690000',
            ],
            [
                'isic_id' => 13,
                'name' => 'กิจกรรมของสำนักงานใหญ่และการบริการให้คำปรึกษาด้านการบริหารจัดการ',
                'code' => 'M700000',
            ],
            [
                'isic_id' => 13,
                'name' => 'กิจกรรมด้านสถาปัตยกรรมและวิศวกรรม รวมถึงการทดสอบและการวิเคราะห์ทางเทคนิค',
                'code' => 'M710000',
            ],
            [
                'isic_id' => 13,
                'name' => 'การวิจัยและพัฒนาเชิงวิทยาศาสตร์',
                'code' => 'M720000',
            ],
            [
                'isic_id' => 13,
                'name' => 'การโฆษณาและการวิจัยตลาด',
                'code' => 'M730000',
            ],
            [
                'isic_id' => 13,
                'name' => 'กิจกรรมทางวิชาชีพ วิทยาศาสตร์ และเทคนิคอื่นๆ',
                'code' => 'M740000',
            ],
            [
                'isic_id' => 13,
                'name' => 'การบริการรักษาสัตว์',
                'code' => 'M750000',
            ],
            [
                'isic_id' => 14,
                'name' => 'กิจกรรมการให้เช่า',
                'code' => 'N770000',
            ],
            [
                'isic_id' => 14,
                'name' => 'กิจกรรมการจ้างงาน',
                'code' => 'N780000',
            ],
            [
                'isic_id' => 14,
                'name' => 'กิจกรรมของตัวแทนธุรกิจท่องเที่ยว การจัดนำเที่ยว การบริการสำรอง และกิจกรรมที่เกี่ยวข้อง',
                'code' => 'N790000',
            ],
            [
                'isic_id' => 14,
                'name' => 'การบริการรักษาความปลอดภัยและการสืบสวน',
                'code' => 'N800000',
            ],
            [
                'isic_id' => 14,
                'name' => 'กิจกรรมการบริการสำหรับอาคารและภูมิทัศน์',
                'code' => 'N810000',
            ],
            [
                'isic_id' => 14,
                'name' => 'การบริการด้านการบริหารและสนับสนุนการดำเนินงานของสำนักงาน และกิจกรรมอื่นๆ ที่สนับสนุนทางธุรกิจ',
                'code' => 'N820000',
            ],
            [
                'isic_id' => 15,
                'name' => 'การบริหารราชการ การป้องกันประเทศ และการประกันสังคมภาคบังคับ',
                'code' => 'O840000',
            ],
            [
                'isic_id' => 16,
                'name' => 'การศึกษา',
                'code' => 'P850000',
            ],
            [
                'isic_id' => 17,
                'name' => 'กิจกรรมด้านสุขภาพของมนุษย์',
                'code' => 'Q860000',
            ],
            [
                'isic_id' => 17,
                'name' => 'กิจกรรมการให้การดูแลที่ให้ที่พัก',
                'code' => 'Q870000',
            ],
            [
                'isic_id' => 17,
                'name' => 'กิจกรรมสังคมสงเคราะห์ที่ไม่ให้ที่พัก',
                'code' => 'Q880000',
            ],
            [
                'isic_id' => 18,
                'name' => 'กิจกรรมการสร้างสรรค์ศิลปะและความบันเทิง',
                'code' => 'R900000',
            ],
            [
                'isic_id' => 18,
                'name' => 'กิจกรรมห้องสมุด หอจดหมายเหตุ พิพิธภัณฑสถาน และกิจกรรมทางวัฒนธรรมอื่นๆ',
                'code' => 'R910000',
            ],
            [
                'isic_id' => 18,
                'name' => 'กิจกรรมการพนันและการเสี่ยงโชค',
                'code' => 'R920000',
            ],
            [
                'isic_id' => 18,
                'name' => 'กิจกรรมด้านการกีฬา ความบันเทิง และนันทนาการ',
                'code' => 'R930000',
            ],
            [
                'isic_id' => 19,
                'name' => 'กิจกรรมองค์การสมาชิก',
                'code' => 'S940000',
            ],
            [
                'isic_id' => 19,
                'name' => 'การซ่อมคอมพิวเตอร์และของใช้ส่วนบุคคลและของใช้ในครัวเรือน   ',
                'code' => 'S950000',
            ],
            [
                'isic_id' => 19,
                'name' => 'กิจกรรมบริการส่วนบุคคลอื่นๆ',
                'code' => 'S960000',
            ],
            [
                'isic_id' => 20,
                'name' => 'กิจกรรมการจ้างงานในครัวเรือนส่วนบุคคล',
                'code' => 'T970000',
            ],
            [
                'isic_id' => 20,
                'name' => 'กิจกรรมการผลิตสินค้าและบริการที่ทำขึ้นเองเพื่อใช้ในครัวเรือน ซึ่งไม่สามารถจำแนกกิจกรรมได้อย่างชัดเจน',
                'code' => 'T980000',
            ],
            [
                'isic_id' => 21,
                'name' => 'กิจกรรมขององค์การระหว่างประเทศและภาคีสมาชิก',
                'code' => 'U990000',
            ]
        ]);
    }
}
