<?php

use Illuminate\Database\Seeder;

class PrefixsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('prefixes')->insert([
            [
            'name' =>'นาย'
            ],
            [
            'name' =>'นาง'
            ],
            [
            'name' =>'นางสาว'
            ],
            [
            'name' =>'คุณ'
            ],
            [
            'name' =>'อื่น ๆ'
            ],
            // [
            // 'name' =>'คุณหญิง'
            // ],
            // [
            // 'name' =>'ศาสตราจารย์นายแพทย์'
            // ],
            // [
            // 'name' =>'แพทย์หญิงคุณหญิง'
            // ],
            // [
            // 'name' =>'นายแพทย์'
            // ],
            // [
            // 'name' =>'แพทย์หญิง'
            // ],
            // [
            // 'name' =>'ทัณตแพทย์'
            // ],
            // [
            // 'name' =>'ทัณตแพทย์หญิง'
            // ],
            // [
            // 'name' =>'สัตวแพทย์'
            // ],
            // [
            // 'name' =>'สัตวแพทย์หญิง'
            // ],
            // [
            // 'name' =>'ผู้ช่วยศาสตราจารย์'
            // ],
            // [
            // 'name' =>'รองศาสตราจารย์'
            // ],
            // [
            // 'name' =>'ศาสตราจารย์'
            // ],
            // [
            // 'name' =>'เภสัชกรชาย'
            // ],
            // [
            // 'name' =>'เภสัชกรหญิง'
            // ],
            // [
            // 'name' =>'หม่อม'
            // ],
            // [
            // 'name' =>'ท่านผู้หญิง'
            // ],
            // [
            // 'name' =>'ศาสตราจารย์คุณหญิง'
            // ],
            // [
            // 'name' =>'ซิสเตอร์'
            // ],
            // [
            // 'name' =>'เจ้าชาย'
            // ],
            // [
            // 'name' =>'เจ้าหญิง'
            // ],
            // [
            // 'name' =>'รองเสวกตรี'
            // ],
            // [
            // 'name' =>'เอกอัครราชฑูต'
            // ],
            // [
            // 'name' =>'พลสารวัตร'
            // ],
            // [
            // 'name' =>'สมเด็จเจ้า'
            // ],
            // [
            // 'name' =>'เจ้าฟ้า'
            // ],
            // [
            // 'name' =>'ศาสตราจารย์ดอกเตอร์'
            // ],
            // [
            // 'name' =>'เจ้านาง'
            // ],
            // [
            // 'name' =>'จ่าสำรอง'
            // ],
            // [
            // 'name' =>'พลเอก'
            // ],
            // [
            // 'name' =>'ว่าที่พลเอก'
            // ],
            // [
            // 'name' =>'พลโท'
            // ],
            // [
            // 'name' =>'พลตรี'
            // ],
            // [
            // 'name' =>'ว่าที่พลตรี'
            // ],
            // [
            // 'name' =>'พันเอกพิเศษ'
            // ],
            // [
            // 'name' =>'ว่าที่พันเอกพิเศษ'
            // ],
            // [
            // 'name' =>'พันเอก'
            // ],
            // [
            // 'name' =>'ว่าที่พันเอก'
            // ],
            // [
            // 'name' =>'พันโท'
            // ],
            // [
            // 'name' =>'ว่าที่พันโท'
            // ],
            // [
            // 'name' =>'พันตรี'
            // ],
            // [
            // 'name' =>'ว่าที่พันตรี'
            // ],
            // [
            // 'name' =>'ร้อยเอก'
            // ],
            // [
            // 'name' =>'ว่าที่ร้อยเอก'
            // ],
            // [
            // 'name' =>'ร้อยโท'
            // ],
            // [
            // 'name' =>'ว่าที่ร้อยโท'
            // ],
            // [
            // 'name' =>'ร้อยตรี'
            // ],
            // [
            // 'name' =>'ว่าที่ร้อยตรี'
            // ],
            // [
            // 'name' =>'จ่าสิบเอก'
            // ],
            // [
            // 'name' =>'จ่าสิบโท'
            // ],
            // [
            // 'name' =>'จ่าสิบตรี'
            // ],
            // [
            // 'name' =>'สิบเอก'
            // ],
            // [
            // 'name' =>'สิบโท'
            // ],
            // [
            // 'name' =>'สิบตรี'
            // ],
            // [
            // 'name' =>'พลทหาร'
            // ],
            // [
            // 'name' =>'นักเรียนนายร้อย'
            // ],
            // [
            // 'name' =>'นักเรียนนายสิบ'
            // ],
            // [
            // 'name' =>'พลจัตวา'
            // ],
            // [
            // 'name' =>'พลฯ อาสาสมัคร'
            // ],
            // [
            // 'name' =>'นักเรียนนายร้อยหม่อมหลวง'
            // ],
            // [
            // 'name' =>'ว่าที่ร้อยตรีหม่อมหลวง'
            // ],
            // [
            // 'name' =>'จ่าสิบเอกหม่อมหลวง'
            // ],
            // [
            // 'name' =>'ร้อยเอกนายแพทย์'
            // ],
            // [
            // 'name' =>'ร้อยเอกแพทย์หญิง'
            // ],
            // [
            // 'name' =>'ร้อยโทนายแพทย์'
            // ],
            // [
            // 'name' =>'พันตรีนายแพทย์'
            // ],
            // [
            // 'name' =>'ว่าที่ร้อยโทนายแพทย์'
            // ],
            // [
            // 'name' =>'พันเอกนายแพทย์'
            // ],
            // [
            // 'name' =>'ร้อยตรีนายแพทย์'
            // ],
            // [
            // 'name' =>'ร้อยโทแพทย์หญิง'
            // ],
            // [
            // 'name' =>'พลตรีนายแพทย์'
            // ],
            // [
            // 'name' =>'พันโทนายแพทย์'
            // ],
            // [
            // 'name' =>'ศาสตราจารย์พันเอก'
            // ],
            // [
            // 'name' =>'พันตรีหลวง'
            // ],
            // [
            // 'name' =>'พลโทหลวง'
            // ],
            // [
            // 'name' =>'ร้อยโทดอกเตอร์'
            // ],
            // [
            // 'name' =>'ร้อยเอกดอกเตอร์'
            // ],
            // [
            // 'name' =>'สารวัตรทหาร'
            // ],
            // [
            // 'name' =>'ร้อยตรีดอกเตอร์'
            // ],
            // [
            // 'name' =>'พันตรีคุณหญิง'
            // ],
            // [
            // 'name' =>'จ่าสิบตรีหม่อมราชวงศ์'
            // ],
            // [
            // 'name' =>'พลจัตวาหลวง'
            // ],
            // [
            // 'name' =>'พลตรีหม่อมราชวงศ์'
            // ],
            // [
            // 'name' =>'พันตรีพระเจ้าวรวงศ์เธอพระองค์'
            // ],
            // [
            // 'name' =>'ท่านผู้หญิงหม่อมราชวงศ์'
            // ],
            // [
            // 'name' =>'ศาสตราจารย์ร้อยเอก'
            // ],
            // [
            // 'name' =>'พันโทคุณหญิง'
            // ],
            // [
            // 'name' =>'ร้อยตรีแพทย์หญิง'
            // ],
            // [
            // 'name' =>'จ่าสิบเอกพิเศษ'
            // ],
            // [
            // 'name' =>'พลเรือเอก'
            // ],
            // [
            // 'name' =>'ว่าที่พลเรือเอก'
            // ],
            // [
            // 'name' =>'พลเรือโท'
            // ],
            // [
            // 'name' =>'ว่าที่พลเรือโท'
            // ],
            // [
            // 'name' =>'พลเรือตรี'
            // ],
            // [
            // 'name' =>'ว่าที่พลเรือตรี'
            // ],
            // [
            // 'name' =>'นาวาเอกพิเศษ'
            // ],
            // [
            // 'name' =>'ว่าที่นาวาเอกพิเศษ'
            // ],
            // [
            // 'name' =>'นาวาเอก'
            // ],
            // [
            // 'name' =>'ว่าที่นาวาเอก'
            // ],
            // [
            // 'name' =>'นาวาโท'
            // ],
            // [
            // 'name' =>'ว่าที่นาวาโท'
            // ],
            // [
            // 'name' =>'นาวาตรี'
            // ],
            // [
            // 'name' =>'ว่าที่นาวาตรี'
            // ],
            // [
            // 'name' =>'เรือเอก'
            // ],
            // [
            // 'name' =>'ว่าที่เรือเอก'
            // ],
            // [
            // 'name' =>'เรือโท'
            // ],
            // [
            // 'name' =>'ว่าที่เรือโท'
            // ],
            // [
            // 'name' =>'เรือตรี'
            // ],
            // [
            // 'name' =>'ว่าที่เรือตรี'
            // ],
            // [
            // 'name' =>'พันจ่าเอก'
            // ],
            // [
            // 'name' =>'พันจ่าโท'
            // ],
            // [
            // 'name' =>'พันจ่าตรี'
            // ],
            // [
            // 'name' =>'จ่าเอก'
            // ],
            // [
            // 'name' =>'จ่าโท'
            // ],
            // [
            // 'name' =>'จ่าตรี'
            // ],
            // [
            // 'name' =>'พลฯทหารเรือ'
            // ],
            // [
            // 'name' =>'นักเรียนนายเรือ'
            // ],
            // [
            // 'name' =>'นักเรียนจ่าทหารเรือ'
            // ],
            // [
            // 'name' =>'พลเรือจัตวา'
            // ],
            // [
            // 'name' =>'นาวาโทหม่อมเจ้า'
            // ],
            // [
            // 'name' =>'นาวาเอกหม่อมเจ้า'
            // ],
            // [
            // 'name' =>'นาวาตรีหม่อมเจ้า'
            // ],
            // [
            // 'name' =>'นาวาตรีแพทย์หญิง'
            // ],
            // [
            // 'name' =>'นาวาอากาศเอกหลวง'
            // ],
            // [
            // 'name' =>'พลเรือตรีหม่อมเจ้า'
            // ],
            // [
            // 'name' =>'นาวาตรีนายแพทย์'
            // ],
            // [
            // 'name' =>'พลเรือตรีหม่อมหลวง'
            // ],
            // [
            // 'name' =>'พลอากาศเอก'
            // ],
            // [
            // 'name' =>'ว่าที่พลอากาศเอก'
            // ],
            // [
            // 'name' =>'พลอากาศโท'
            // ],
            // [
            // 'name' =>'ว่าที่พลอากาศโท'
            // ],
            // [
            // 'name' =>'พลอากาศตรี'
            // ],
            // [
            // 'name' =>'ว่าที่พลอากาศตรี'
            // ],
            // [
            // 'name' =>'นาวาอากาศเอกพิเศษ'
            // ],
            // [
            // 'name' =>'ว่าที่นาวาอากาศเอกพิเศษ'
            // ],
            // [
            // 'name' =>'นาวาอากาศเอก'
            // ],
            // [
            // 'name' =>'ว่าที่นาวาอากาศเอก'
            // ],
            // [
            // 'name' =>'นาวาอากาศโท'
            // ],
            // [
            // 'name' =>'ว่าที่นาวาอากาศโท'
            // ],
            // [
            // 'name' =>'นาวาอากาศตรี'
            // ],
            // [
            // 'name' =>'ว่าที่นาวาอากาศตรี'
            // ],
            // [
            // 'name' =>'เรืออากาศเอก'
            // ],
            // [
            // 'name' =>'ว่าที่เรืออากาศเอก'
            // ],
            // [
            // 'name' =>'เรืออากาศโท'
            // ],
            // [
            // 'name' =>'ว่าที่เรืออากาศโท'
            // ],
            // [
            // 'name' =>'เรืออากาศตรี'
            // ],
            // [
            // 'name' =>'ว่าที่เรืออากาศตรี'
            // ],
            // [
            // 'name' =>'พันจ่าอากาศเอก'
            // ],
            // [
            // 'name' =>'พันจ่าอากาศโท'
            // ],
            // [
            // 'name' =>'พันจ่าอากาศตรี'
            // ],
            // [
            // 'name' =>'จ่าอากาศเอก'
            // ],
            // [
            // 'name' =>'จ่าอากาศโท'
            // ],
            // [
            // 'name' =>'จ่าอากาศตรี'
            // ],
            // [
            // 'name' =>'พลฯทหารอากาศ'
            // ],
            // [
            // 'name' =>'นักเรียนนายเรืออากาศ'
            // ],
            // [
            // 'name' =>'นักเรียนจ่าอากาศ'
            // ],
            // [
            // 'name' =>'นักเรียนพยาบาลทหารอากาศ'
            // ],
            // [
            // 'name' =>'เรืออากาศโทขุน'
            // ],
            // [
            // 'name' =>'พันจ่าอากาศเอกหม่อมหลวง'
            // ],
            // [
            // 'name' =>'เรืออากาศเอกนายแพทย์'
            // ],
            // [
            // 'name' =>'พลอากาศเอกหม่อมราชวงศ์'
            // ],
            // [
            // 'name' =>'พลอากาศตรีหม่อมหลวง'
            // ],
            // [
            // 'name' =>'พลอากาศจัตวา'
            // ],
            // [
            // 'name' =>'พลอากาศโทหม่อมราชวงศ์'
            // ],
            // [
            // 'name' =>'นาวาอากาศเอกหม่อมหลวง'
            // ],
            // [
            // 'name' =>'พระครูพิบูลสมณธรรม'
            // ],
            // [
            // 'name' =>'พลตำรวจเอก'
            // ],
            // [
            // 'name' =>'ว่าที่พลตำรวจเอก'
            // ],
            // [
            // 'name' =>'พลตำรวจโท'
            // ],
            // [
            // 'name' =>'ว่าที่พลตำรวจโท'
            // ],
            // [
            // 'name' =>'พลตำรวจตรี'
            // ],
            // [
            // 'name' =>'ว่าที่พลตำรวจตรี'
            // ],
            // [
            // 'name' =>'พลตำรวจจัตวา'
            // ],
            // [
            // 'name' =>'ว่าที่พลตำรวจจัตวา'
            // ],
            // [
            // 'name' =>'พันตำรวจเอก (พิเศษ)'
            // ],
            // [
            // 'name' =>'ว่าที่พันตำรวจเอก(พิเศษ)'
            // ],
            // [
            // 'name' =>'พันตำรวจเอก'
            // ],
            // [
            // 'name' =>'ว่าที่พันตำรวจเอก'
            // ],
            // [
            // 'name' =>'พันตำรวจโท'
            // ],
            // [
            // 'name' =>'ว่าที่พันตำรวจโท'
            // ],
            // [
            // 'name' =>'พันตำรวจตรี'
            // ],
            // [
            // 'name' =>'ว่าที่พันตำรวจตรี'
            // ],
            // [
            // 'name' =>'ร้อยตำรวจเอก'
            // ],
            // [
            // 'name' =>'ว่าที่ร้อยตำรวจเอก'
            // ],
            // [
            // 'name' =>'ร้อยตำรวจโท'
            // ],
            // [
            // 'name' =>'ว่าที่ร้อยตำรวจโท'
            // ],
            // [
            // 'name' =>'ร้อยตำรวจตรี'
            // ],
            // [
            // 'name' =>'ว่าที่ร้อยตำรวจตรี'
            // ],
            // [
            // 'name' =>'นายดาบตำรวจ'
            // ],
            // [
            // 'name' =>'จ่าสิบตำรวจ'
            // ],
            // [
            // 'name' =>'สิบตำรวจเอก'
            // ],
            // [
            // 'name' =>'สิบตำรวจโท'
            // ],
            // [
            // 'name' =>'สิบตำรวจตรี'
            // ],
            // [
            // 'name' =>'นักเรียนนายร้อยตำรวจ'
            // ],
            // [
            // 'name' =>'นักเรียนนายสิบตำรวจ'
            // ],
            // [
            // 'name' =>'นักเรียนพลตำรวจ'
            // ],
            // [
            // 'name' =>'พลตำรวจ'
            // ],
            // [
            // 'name' =>'พลตำรวจพิเศษ'
            // ],
            // [
            // 'name' =>'พลตำรวจอาสาสมัคร'
            // ],
            // [
            // 'name' =>'พลตำรวจสำรอง'
            // ],
            // [
            // 'name' =>'พลตำรวจสำรองพิเศษ'
            // ],
            // [
            // 'name' =>'พลตำรวจสมัคร'
            // ],
            // [
            // 'name' =>'สมาชิกอาสารักษาดินแดน'
            // ],
            // [
            // 'name' =>'นายกองใหญ่'
            // ],
            // [
            // 'name' =>'นายกองเอก'
            // ],
            // [
            // 'name' =>'นายกองโท'
            // ],
            // [
            // 'name' =>'นายกองตรี'
            // ],
            // [
            // 'name' =>'นายหมวดเอก'
            // ],
            // [
            // 'name' =>'นายหมวดโท'
            // ],
            // [
            // 'name' =>'นายหมวดตรี'
            // ],
            // [
            // 'name' =>'นายหมู่ใหญ่'
            // ],
            // [
            // 'name' =>'นายหมู่เอก'
            // ],
            // [
            // 'name' =>'นายหมู่โท'
            // ],
            // [
            // 'name' =>'นายหมู่ตรี'
            // ],
            // [
            // 'name' =>'สมาชิกเอก'
            // ],
            // [
            // 'name' =>'สมาชิกโท'
            // ],
            // [
            // 'name' =>'สมาชิกตรี'
            // ],
            // [
            // 'name' =>'อาสาสมัครทหารพราน'
            // ],
            // [
            // 'name' =>'พันตำรวจโทหม่อมเจ้า'
            // ],
            // [
            // 'name' =>'พันตำรวจเอกหม่อมเจ้า'
            // ],
            // [
            // 'name' =>'นักเรียนนายร้อยตำรวจหม่อมเจ้า'
            // ],
            // [
            // 'name' =>'ศาสตราจารย์นายแพทย์พันตำรวจเอก'
            // ],
            // [
            // 'name' =>'พันตำรวจโทนายแพทย์'
            // ],
            // [
            // 'name' =>'ร้อยตำรวจโทนายแพทย์'
            // ],
            // [
            // 'name' =>'ร้อยตำรวจเอกนายแพทย์'
            // ],
            // [
            // 'name' =>'พันตำรวจตรีนายแพทย์'
            // ],
            // [
            // 'name' =>'พันตำรวจเอกนายแพทย์'
            // ],
            // [
            // 'name' =>'พันตำรวจตรีหลวง'
            // ],
            // [
            // 'name' =>'ร้อยตำรวจโทดอกเตอร์'
            // ],
            // [
            // 'name' =>'พันตำรวจเอกดอกเตอร์'
            // ],
            // [
            // 'name' =>'พันตำรวจเอกหญิง ท่านผู้หญิง'
            // ],
            // [
            // 'name' =>'พลตำรวจตรีหม่อมหลวง'
            // ],
            // [
            // 'name' =>'พลตรีหญิง คุณหญิง'
            // ],
            // [
            // 'name' =>'ว่าที่สิบเอก'
            // ],
            // [
            // 'name' =>'พลตำรวจเอกดอกเตอร์'
            // ]
        ]);
    }
}
