<?php

use Illuminate\Database\Seeder;

class ThaiBanksTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('thai_banks')->insert([
            [
                'name' => 'ธนาคารกรุงเทพ'
            ],
            [
                'name' => 'ธนาคารกรุงไทย'
            ],
            [
                'name' => 'ธนาคารกรุงศรีอยุธยา'
            ],
            [
                'name' => 'ธนาคารกสิกรไทย'
            ],
            [
                'name' => 'ธนาคารเกียรตินาคิน'
            ],
            [
                'name' => 'ซิตี้แบงก์ประเทศไทย'
            ],
            [
                'name' => 'ธนาคารซีไอเอ็มบีไทย'
            ],
            [
                'name' => 'ธนาคารทหารไทย'
            ],
            [
                'name' => 'ธนาคารไทยพาณิชย์'
            ],
            [
                'name' => 'ธนาคารไทยเครดิตเพื่อรายย่อย'
            ],
            [
                'name' => 'ธนาคารธนชาต'
            ],
            [
                'name' => 'ธนาคารทิสโก้'
            ],
            [
                'name' => 'ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย'
            ],
            [
                'name' => 'ธนาคารอิสลามแห่งประเทศไทย'
            ],
            [
                'name' => 'ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย'
            ],
            [
                'name' => 'ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร'
            ],
            [
                'name' => 'ธนาคารยูโอบี'
            ],
            [
                'name' => 'ธนาคารออมสิน'
            ],
            [
                'name' => 'ธนาคารอาคารสงเคราะห์'
            ],
            [
                'name' => 'อื่น ๆ โปรดระบุ'
            ]
        ]);
    }
}
