<?php

use Illuminate\Database\Seeder;

class ThaiBanksTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('thai_banks')->insert([
            [
                'name' => 'ธนาคารกรุงเทพ (BBL)'
            ],
            [
                'name' => 'ธนาคารกรุงไทย (KTB)'
            ],
            [
                'name' => 'ธนาคารกรุงศรีอยุธยา (BAY)'
            ],
            [
                'name' => 'ธนาคารกสิกรไทย (KBANK)'
            ],
            [
                'name' => 'ธนาคารเกียรตินาคิน (KK)'
            ],
            [
                'name' => 'ซิตี้แบงก์ประเทศไทย (CITI)'
            ],
            [
                'name' => 'ธนาคารซีไอเอ็มบีไทย (CIMB)'
            ],
            [
                'name' => 'ธนาคารทหารไทยธนชาติ (TTB)'
            ],
            [
                'name' => 'ธนาคารไทยพาณิชย์ (SCB)'
            ],
            [
                'name' => 'ธนาคารไทยเครดิตเพื่อรายย่อย (TRCBANK)'
            ],
            [
                'name' => 'ธนาคารทิสโก้ (TISCO)'
            ],
            [
                'name' => 'ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย'
            ],
            [
                'name' => 'ธนาคารอิสลามแห่งประเทศไทย'
            ],
            [
                'name' => 'ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย'
            ],
            [
                'name' => 'ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร (BAAC)'
            ],
            [
                'name' => 'ธนาคารยูโอบี (UOB)'
            ],
            [
                'name' => 'ธนาคารออมสิน (GSB)'
            ],
            [
                'name' => 'ธนาคารอาคารสงเคราะห์ (GHB)'
            ],
            [
                'name' => 'อื่นๆ โปรดระบุ'
            ]
        ]);
    }
}
