<?php

use Illuminate\Database\Seeder;

class WebpagesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('web_pages')->insert([
            [
                'name' => 'แนะนำบริการ',
                'slug' => 'แนะนำบริการ',
                'body' => '<p>แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ แนะนำบริการ</p>',
                'status' => 1
            ],
            [
                'name' => 'ผลการดำเนินงาน',
                'slug' => 'ผลการดำเนินงาน',
                'body' => '<p>ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน ผลการดำเนินงาน</p>',
                'status' => 1
            ],
            [
                'name' => 'ขั้นตอนการบริการ',
                'slug' => 'ขั้นตอนการบริการ',
                'body' => '<p>ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ ขั้นตอนการบริการ</p>',
                'status' => 1
            ]
        ]);
    }
}
